# 거스름돈 계산
a = int(input("가지고 있는 돈을 입력하세요: "))
b = int(input("물건 값을 입력하세요: "))
<<<<<<< HEAD
c = a - b 

print("\n<결과>")


if a < b :
    print("돈이 부족합니다")
else:
    print("거스름돈:", c)

=======
c = a - b  # 수정: 대입 방향 변경 (c = a - b)

print("\n<결과>")
print("거스름돈:", c)

# 들여쓰기를 같은 위치로 맞추어 작성합니다.
>>>>>>> a157d29 (Update)
if c >= 50000:
    print("5만원권:", c // 50000)
    c = c % 50000

if c >= 10000:
    print("1만원권:", c // 10000)
    c = c % 10000

if c >= 5000:
    print("5천원권:", c // 5000)
    c = c % 5000

if c >= 1000:
    print("1천원권:", c // 1000)
    c = c % 1000

if c > 0:
    print("남은 돈:", c, "원")